app/graphql/mutations/create_transaction.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 1000], ["updated_at", "2022-10-17 13:00:00.918900"], ["id", 2]]
INSERT INTO "transactions" ("account_id", "amount", "created_at", "updated_at", "debit_account_id", "credit_account_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["account_id", 2], ["amount", 1000], ["created_at", "2022-10-17 13:00:00.964214"], ["updated_at", "2022-10-17 13:00:00.964214"], ["debit_account_id", 2], ["credit_account_id", 1]]
---
    def resolve(creditAccountId:, debitAccountId:, accountId:, amount:)
      account = Account.find(accountId);
      debit_account = Account.find(debitAccountId);
      credit_account = Account.find(creditAccountId);
      begin
        if account && debit_account && credit_account  && amount > 0 && account.balance > 0 &&
          (debitAccountId != creditAccountId)
          debit_account_balance = account.balance - amount
          credit_account_balance = credit_account.balance + amount
          if account.update(balance: debit_account_balance) && credit_account.update(balance: credit_account_balance)
            transaction = account.transactions.create(
              amount: amount,
              debit_account_id: debitAccountId,
              credit_account_id: creditAccountId,
            )