app/graphql/types/query_type.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def account(id:)
      Account.find_by(id: id)